[
    {
        "date": "2024-04-20",
        "title": "Romper",
        "content": [
            "就在我骑车在路上的时候，手机震动了好几下，当时没有在意，后来发现原来是我大学为数不多的挚友发的消息，他们...",
            "其实在那节课上，我就有预感到了这事情，也许当时没有太在意那些细节，以为只不过是一场误会罢了，后来发现原来和我想到的是一样的，也许这就是人生每个阶段的一部分吧",
            "其实我觉得吧，他是只是在正确的时间去遇上了不合适的人吧，也没有什么可以分析，反正就是场人间话剧罢了。况且他也足够的优秀，也有足够的时间",
            "确实，很难的遇上像你的一样的freak，这倒是真的，我就是那么幸运的一位吧，也许是被我同化了吧hhhh。",
            "我好像最近一直在和时间是做斗争一样，因为足够的熬夜，足够的莫名其妙就让时间跑掉了，算了算，一天睡眠的时间有8h(4-12)，但是剩下的时间可能只有1/3的是在写代码或者是学习，其他的时间就白白浪费了，但是反过来想，因为前21年就是这样苟活的",
            "如此放纵，想想那几位实验室的ranker，只能说自愧不如，尤其是qh学长和sq，pk。他们也许就是另外一个世界的，是我这种凡夫俗子？Freak！感受不到的。羡慕？可能是发自内心的尊敬吧"
        ],
        "img": ""
    },
    {
        "date": "2024-04-16",
        "title": "!Tailwindcss",
        "content": [
            "好久没有写这个博客了。也不知道什么时候是个头，一点一点写吧，前段时间在忙被的事情，还有瓦，一个爱恨交织的游戏",
            "起初用tailwindcss的时候觉得还挺好用的，但是用久了会发现，当样式写多就真的阅读性很低，而且有很多很奇怪的css得不断的去Doc里面找，<c-k>快按烂了",
            "就像是这种 background: repeating-conic-gradient(#000 0 0.0001%, #0000 0 0.0002%) 60% 60% / 2000px 3000px 这种噪点效果实在是不好去用tailwindcss去做",
            "所以有些时候，回归最原始的方法不一定是坏处，没必要去最求什么，最新不一定是最好，也许",
            "雅思也不知道什么时候是一个尽头感觉，感觉就是一个拿时间去对切的东西，没有什么奇怪的。",
            "一写一度的审查还有什么没有写，主页的那个视觉差还没有写，也不知道什么时候去做，挺想试一试的，然后加载的动画，调转的动画，还有ABOut页面,也许可以和主页面合并，等会试一试"
        ],
        "img": ""
    },
    {
        "date": "2024-03-27",
        "title": "他们",
        "content": [
            "晚上背单词的时候，才想起来，明天可能要和czy和素姐吃饭了，素姐快毕业了，这也许就是时间吧，我们三个人认识要追溯到初中",
            "初中毕业，高中毕业，大学毕业，一晃就是10年功夫，而且好巧不巧，一路上虽然我们没有太多交集，但是始终是在同一个城市的同一个片区走完。很难想象这就是 1 decade的感觉",
            "最近应该没有什么时间去写这个网站的代码了，事情比较的多，但是我希望能坚持把这个博客写完，突然意识到，别人多博客大多是就是在记录自己的学习笔记类似的，感觉这也太无聊，真不如在这里写一些，你自己都不知道在写些什么的东西，正所谓yakyak么",
            "从目前的阶段来看，我需要把我的music的代码和动画优化好，把路由动画做了，把加载做了，把首页做了。目标是在今年写完就好，我觉得有些时候，没必要太急着去完成，因为又不是上班",
            "我的照片放在哪个在线图床呢？我现在去查找下"
        ],
        "img": ""
    },
    {
        "date": "2024-03-15",
        "title": "深夜切忌勿想",
        "content": [
            "12点闭上眼，1点钟脑子里的梦魇就开始发力了，随着越想越多，翻阅着记忆碎片我突然发现，我一如既往一如既往。终究还是等到了回旋镖的一天，彻夜难眠，我也不知道我该如何是好。",
            "我很怕会变成曾经，我却很享受曾经，虽然这样写像是我感情出问题。只不是我直接都还是感觉被过去给困住了，困在一个叫现在的东西里面。",
            "既然已经下床写东西了，那就写下我的杂乱无章的思绪。 ",
            "1. 我发现似乎还是那个当时的我，炉石，日记，二职，拍照（有设计的，优雅的，带有个人flavor的）照片，画画（虽然很糟糕，但是很享受过程的），",
            "2. 我意识到我那时还真是个天才少年吧，查了下今年U18的100米和200米的决赛成绩，感觉也就那样？22.97 11.22 16岁，我可能当时真不绝的怎么样，但是现在看来也是相当的含金量的",
            "3. 我突然意识到每次我都会有那么一刹那，这也许就是上天的安排，需要我一生去救赎的东西，“计较于失败会让你止步不前”。你说的对呀，有很多次我都在脑海中想象着那最后的最后，想象着在苦苦的追随着巴士，最后的最后在下一次的巴士上看到了答案。信仰什么时候从一个带有中抽象的宗教色彩的词语变成了一个具象的事物",
            "4. 我突然意识到也许，我可能最求的是最纯粹的东西，不是功成名就，不是物质财富。纯粹的，像是那一圈又一圈的影子。",
            "5. 想想看是什么时候开始有写这种抽象的文字垃圾的？也许就是在伤病之后，也许就是在丢失了那双陪我征战了3年的钉鞋，也许这些文字就是字里行间里忏悔吧。",
            "已经是凌晨4点来，写下响应式吧，腰痛"
        ],
        "img": ""
    },
    {
        "date": "2024-03-14",
        "title": "犹犹豫豫",
        "content": [
            "今天终算是写了些Gsap和Typeit的动画，感觉在vue里掉用也没有想象中的难，但是我还是的把代码里的残留和奇奇怪怪的东西给清理下",
            "不下很多次的准备换一个新的游戏本，虽然说价格已经不是最需要考虑的事情了吗，发现是自己能否下定决心又给它整回来，导致我网瘾重返，一发不可收拾",
            "所以犹犹豫豫，还有一点就是3070ti or 4060，敢不敢去赌拆封机。其实我突然觉得没有游戏的日子也不是不能过，挣扎着，纠结着，又差不多2周时间了。好像没有那么大挣扎了，但是始终感觉心痒痒 ",
            "到底答案是什么？谁又知道呢？如此纠结着。突然想了下，如果是我的mac坏了，我可能第二天就去换一台，毕竟是我。侧面反映出，游戏也许不是我的挚爱了，至是一种从现实世界的解脱"
        ],
        "img": ""
    },
    {
        "date": "2024-03-14",
        "title": "lazyVim or vscode",
        "content": [
            "lazyVim or vscode 一个值得深思的问题，我始终是用不惯nvim，享受vscode的很多无脑操作，但是vscode的卡顿和占用内存实在是太大了，还有哪些奇怪的LSP问题，简直是然我感到厌恶",
            "当然很多人会说vim是值得的，但是好像总是感觉时间不够用，没有办法去长时间的适应这个玩具。而且我其实挺喜欢vim + vscode这个体系的。因为我现在还是写些前端的垃圾，所以可能在很多页面中切换，跳转，vscode会跟加的合适些。",
            "有些时候，我记得合适自己的就好，但是还是羡慕那种用vim丝滑优雅的感觉，简直是行云流水，立竿见影。whatever 先走一步看一吧",
            "有些时候我觉得，用vscode默认的快捷键已经很快了，但是我觉得是3j这种更加的快速，纠结纠结，如影随形。pretty sad :)"
        ],
        "img": ""
    },
    {
        "date": "2024-03-12",
        "title": "断·舍·离",
        "content": [
            "断舍离应该是我最难去解决的事情，因为有些时候我感觉就是会非常上瘾一件事，奔跑，游戏，这个该死的Blog（coding），赖床，还有很多很多的东西",
            "这也会导致我没有办法去做跟多的多的事情，没有办法去长时间专注做一件需要去做的事情，但是很多机缘巧合，我被迫就去断舍离了，有的成为了梦魇，有的成为了Good benefit。",
            "那几次拉伤，导致我失去了我的奔跑的权利，但是有的人说，你不是可以跑起来么，还是可以跑下去，但是我想说nop，its the end，我在那个黄金年龄里正准备去踏足下一个巅峰的时候，跌落谷底。这也是每次听到宝石（英雄联盟的一个角色）的台词，我曾踏足山巅，也曾进入低谷，二者都使我受益良多的时候，真的感慨万分。",
            "因为我的奔跑全部停留在了每次进入到鸟巢，每次聆听准备上道的人群白噪声，每次准备起跑器时心中默念的左一右二，每次双手虎口向下是的耸肩，每次等待枪声时候的看到凹凹凸凸的橡胶地面，每次下弯道的时候的爆发，每次在跑完后的眩晕感里面了。",
            "就像是一场梦，最终还是有醒来的一天，梦醒来的那一刻，realize美梦最终还是会成为你的梦魇，成为你最终无法企及的地方。我很喜欢用梦魇来形容我的那短短10年，因为它是梦想是如今幻想中的自己，因为它是魇他是让我如今恐惧的自己",
            "但是如今的我似乎也挺感谢拉伤，因为我知道我的天赋是没法去考这个吃饭的，虽然我可能在曾经是他们口中的体育生，但是并不喜欢社交，并不喜欢喝酒，并不喜欢去做一个‘体育生’，我喜欢一个的世界，我喜欢一个安安静静的世界，我并不希望嘈杂声侵蚀我的一切。就像是上方的音乐一样",
            "可以去做自己喜欢的事情，可以去尝试新的赛道，可以尝试去学习什么的coding，which is 我可以对着电脑喃喃自语着它听的懂的语言。我也可以有更多的下午时间来享受现实的折磨而非躲在鸟巢里享受夏日烈焰下的一分一秒。",
            "你说断舍离，不就是这个过程么，首先是最痛苦的断，再是心有余悸的舍，最终解脱释然的离。一个断舍离，进入下一个阶段，等待着下一个断舍离的到来。",
            "就像是如今不慌不忙的写着东西，做着雅思题目，就是因为我刚刚被迫说“断”和我的游戏本，和我挚爱的游戏，显卡引脚的断裂就好像是和我右脚拉伤不谋而和了。",
            "我还有都没有感受到如此的平静的内心了，有着大把的时间可以去享受在这里喃喃低语的感觉，这也是我喜欢yakyak这个词，这个状态。",
            "今天就到这里吧，准备下手机适配的代码然后commit，也同时准备下倒霉日子的到来。"
        ],
        "img": ""
    },
    {
        "date": "2024-03-11",
        "title": "真的是兜兜又转转",
        "content": [
            "别人家的主页和别人家的效果，是真的写不出来的哥们，不如老老实实写自己的",
            "又又又在编写json文件，很好，很的很棒，时间有限，太多事情要做了，今天就暂时写到这里吧，这个项目估计是还要话费我很长的时间去做",
            "还有什么要去写，让我想想，首先，谢谢你滑动阻尼和无限img，这效果就是有蠢逼写不出来，我真的是谢谢，还有啥字咧？HomepagePart2还没有做,还有后面两个主页没有写效果，估计又是要沉淀到我想明白想到天荒地老的时候吧",
            "我感觉还有好多事情没有去做，全部都荒废到啦这个破blog上面，关键是腰痛了，细阿无腰？有！还很痛",
            "洗个澡，美美的玩下炉石传说好了，炉石真的是我的拯救者，小时候没电脑的时候，每天只能搓炉石，现在电脑坏了，只能用炉石来治疗我的网瘾",
            "为什么这copilot还在提示我写我的壁画，它明明代码都写不明白，还要在这里教我说话，谢谢你copilot，我真的是（超）感（市）谢你",
            "·示例图片URL2·,哦，对了，我的图片加入还没有写，那就先示例吧.刚刚还看了下我的music还没有做载入等待，草，这个和到时候的pageTransport一起写吧",
            "刚刚又手贱看了下，还有一个手机的适配和折叠功能没有写，长路漫漫漫漫漫漫漫漫漫漫漫漫，好今天再碰一下这个项目我是狗",
            "汪汪🐶，你为什么不用hexo"
        ],
        "img": ""
    },
    {
        "date": "2024-03-10",
        "title": "有些时候慢慢来才好",
        "content": [
            "Gsap真的是一个很好的库，但是我现在还是不会用，但是我相信我会的，只是时间问题",
            "没有想到上一句居然是Copilot给我写的，抽象",
            "也许确实我该解决下这个在json里写东西的方法，愚蠢至极，还要跑一个nootbook去转码，我在这里打字，copilot疯狂在这里提示",
            "今天尝试去写下滑动阻尼",
            "当然，主页也该换一下了，想去自己又又又又一次重写一个，当然希望是最后一次，也后怕不是最后一次"
        ],
        "img": ""
    },
    {
        "date": "2024-03-09",
        "title": "兜兜转转还是回到了现在",
        "content": [
            "我也不不知道说什么好，hexo，svelte，react，next全都试了一遍，最后还是觉得就用vue好了，也许就是技艺不精吧。但是这是我自己的傻逼网站所以go fuck yourself",
            "虽然很想去深入了解一下react，但是时间和脑子都阻止了我",
            "感觉我现在在json文件就像是原始人一样的，很难想象如今还有人没有找到一个合适的东西，去保持他这摊烂字，于是乎他就保存在一个json文件里",
            "还要有一个傻逼notebook给他转成unicode，简直是有点蠢，但是我又很乐意去做，至少能写会代码",
            "当然最近是真的真的很糟糕就是了，等会再写下吧"
        ],
        "img": ""
    }
]